<a href="https://colab.research.google.com/github/Kate5-7-2021/Kate_INFO5731_Spring2021/blob/main/Copy_of_In_class_exercise_04.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **The fourth in-class-exercise (20 points in total, 2/9/2021)**

# 1. Text Data Preprocessing

Here is a [legal case](https://github.com/unt-iialab/info5731_spring2021/blob/main/class_exercises/01-05-1%20%20Adams%20v%20Tanner.txt) we collected from westlaw, please follow the steps we mentioned in lesson 5 to clean the data:



## 1.1 Basic feature extraction using text data (4 points)

*   Number of sentences
*   Number of words
*   Number of characters
*   Average word length
*   Number of stopwords
*   Number of special characters
*   Number of numerics
*   Number of uppercase words

## 1.2 Basic Text Pre-processing of text data (4 points)

*   Lower casing
*   Punctuation removal
*   Stopwords removal
*   Frequent words removal
*   Rare words removal
*   Spelling correction
*   Tokenization
*   Stemming
*   Lemmatization

## 1.3 Save all the **clean sentences** to a **csv file** (one column, each raw is a sentence) after finishing all the steps above. (4 points)


## 1.4 Advance Text Processing (Extra credit: 4 points)

*   Calculate the term frequency of all the terms.
*   Print out top 10 1-gram, top 10 2-grams, and top 10 3-grams terms as features.

#Start Coding

###1.1 Basic feature extraction using text data

In [341]:
import pandas as pd
url="https://raw.githubusercontent.com/unt-iialab/info5731_spring2021/main/class_exercises/01-05-1%20%20Adams%20v%20Tanner.txt"

case = pd.read_csv(url , error_bad_lines=False, header=None)      # create dataframe from csv file
                                                     #print the first 5 rows

b'Skipping line 7: expected 1 fields, saw 2\nSkipping line 19: expected 1 fields, saw 2\nSkipping line 25: expected 1 fields, saw 4\nSkipping line 28: expected 1 fields, saw 44\nSkipping line 29: expected 1 fields, saw 12\nSkipping line 31: expected 1 fields, saw 31\nSkipping line 32: expected 1 fields, saw 8\nSkipping line 33: expected 1 fields, saw 6\nSkipping line 34: expected 1 fields, saw 5\nSkipping line 37: expected 1 fields, saw 2\nSkipping line 39: expected 1 fields, saw 25\nSkipping line 40: expected 1 fields, saw 9\nSkipping line 41: expected 1 fields, saw 21\nSkipping line 42: expected 1 fields, saw 66\nSkipping line 43: expected 1 fields, saw 10\nSkipping line 44: expected 1 fields, saw 15\nSkipping line 45: expected 1 fields, saw 2\nSkipping line 49: expected 1 fields, saw 2\nSkipping line 50: expected 1 fields, saw 6\nSkipping line 51: expected 1 fields, saw 8\nSkipping line 52: expected 1 fields, saw 15\nSkipping line 53: expected 1 fields, saw 33\nSkipping line 55: expected 1 fields, saw 2\nSkipping line 67: expected 1 fields, saw 3\nSkipping line 68: expected 1 fields, saw 2\nSkipping line 73: expected 1 fields, saw 2\nSkipping line 74: expected 1 fields, saw 3\nSkipping line 81: expected 1 fields, saw 3\nSkipping line 88: expected 1 fields, saw 3\nSkipping line 95: expected 1 fields, saw 3\nSkipping line 102: expected 1 fields, saw 3\nSkipping line 103: expected 1 fields, saw 6\nSkipping line 109: expected 1 fields, saw 3\nSkipping line 116: expected 1 fields, saw 3\nSkipping line 117: expected 1 fields, saw 2\nSkipping line 124: expected 1 fields, saw 6\nSkipping line 138: expected 1 fields, saw 3\nSkipping line 139: expected 1 fields, saw 5\nSkipping line 144: expected 1 fields, saw 3\nSkipping line 150: expected 1 fields, saw 3\nSkipping line 151: expected 1 fields, saw 7\n'

In [342]:
case.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 107 entries, 0 to 106
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       107 non-null    object
dtypes: object(1)
memory usage: 984.0+ bytes

In [343]:
case.head(5)

                           0
0                 5 Ala. 740
1  Supreme Court of Alabama.
2                      ADAMS
3                         v.
4         TANNER AND HORTON.

In [344]:
case.columns = ['sentence']                             # create header for dataframe column
case.head(5)

                    sentence
0                 5 Ala. 740
1  Supreme Court of Alabama.
2                      ADAMS
3                         v.
4         TANNER AND HORTON.

In [345]:
print(len(case['sentence']))                         #number of the sentences

107

In [348]:
#num_words=df['sentence'].apply(lambdax: len(str(x).split(' ')
#df['sent_words'] = len(num_words)
case['num_words']=case['sentence'].apply(lambda x: len(str(x).split(' ')))   #number of words
case.head(5)

                    sentence  num_char  num_words
0                 5 Ala. 740        10          3
1  Supreme Court of Alabama.        25          4
2                      ADAMS         5          1
3                         v.         2          1
4         TANNER AND HORTON.        18          3

In [349]:
case['num_char']= case['sentence'].str.len()     #number of charracters

case[['sentence','num_words','num_char']].head(5)

                    sentence  num_words  num_char
0                 5 Ala. 740          3        10
1  Supreme Court of Alabama.          4        25
2                      ADAMS          1         5
3                         v.          1         2
4         TANNER AND HORTON.          3        18

In [351]:
def avg_word_len(sentence):
  words = sentence.split()
  #return (sum(len(word) for word in words)/len(words))   # with this line of the code there is an error for division by zero
                                                          # so the use of if/else will solve this issue

  if len(words)!=0:
    return (sum(len(word) for word in words)/len(words))
  else:
    return 0

#case['avg_word_len']= case['num_char']/case['num_words']                 #this line and the next line both have the results of avarage of
case['avg_word_len']=case['sentence'].apply(lambda x: avg_word_len(x))    # word lenght, but their results in some cases are different numbers
case[['sentence','num_words','num_char','avg_word_len']].head(5)

                    sentence  num_words  num_char  avg_word_len
0                 5 Ala. 740          3        10      2.666667
1  Supreme Court of Alabama.          4        25      5.500000
2                      ADAMS          1         5      5.000000
3                         v.          1         2      2.000000
4         TANNER AND HORTON.          3        18      5.333333

In [352]:
case['avg_word_len']= case['num_char']/case['num_words']  

case.sample(5)                                   #get the sample of avarage word leght with this line of code

                           sentence  num_char  num_words  avg_word_len
82                        Treatment         9          1      9.000000
32                    Dec Term 1876        13          3      4.333333
12  4 Cases that cite this headnote        31          6      5.166667
13                              [2]         3          1      3.000000
10                Chattel Mortgages        17          2      8.500000

In [353]:
!pip install nltk                         #install the necessary packages
!pip install stopword
import stopword
import nltk
nltk.download('stopwords')
from nltk.corpus import stopwords

Requirement already satisfied: nltk in /usr/local/lib/python3.6/dist-packages (3.2.5)
Requirement already satisfied: six in /usr/local/lib/python3.6/dist-packages (from nltk) (1.15.0)
Requirement already satisfied: stopword in /usr/local/lib/python3.6/dist-packages (0.0.4)
[nltk_data] Downloading package stopwords to /root/nltk_data...
[nltk_data]   Package stopwords is already up-to-date!

In [354]:
stop_list=stopwords.words('english')
case['stopwords']=case['sentence'].apply(lambda x: len([item for item in x.split() if item in stop_list]))    #Num of stopwords
case[['sentence','num_words','num_char','avg_word_len','stopwords']].head(5)

                    sentence  num_words  num_char  avg_word_len  stopwords
0                 5 Ala. 740          3        10      3.333333          0
1  Supreme Court of Alabama.          4        25      6.250000          1
2                      ADAMS          1         5      5.000000          0
3                         v.          1         2      2.000000          0
4         TANNER AND HORTON.          3        18      6.000000          0

In [355]:
#case['stopwords']=case['sentence'].apply(lambda x: [item for item in x.split() if item in stop_list])  #the list of stopwords in each sentence
#case[['sentence','num_words','num_char','avg_word_len','stopwords']].head(5)

In [356]:
case['periods'] = case['sentence'].apply(lambda x: len([item for item in x.split() if item.endswith('.')])) # Number of special character
case[['sentence','num_words','num_char','avg_word_len','stopwords','periods']].head(5)

                    sentence  num_words  ...  stopwords  periods
0                 5 Ala. 740          3  ...          0        1
1  Supreme Court of Alabama.          4  ...          1        1
2                      ADAMS          1  ...          0        0
3                         v.          1  ...          0        1
4         TANNER AND HORTON.          3  ...          0        1

[5 rows x 6 columns]

In [357]:
case['numerics'] = case['sentence'].apply(lambda x: len([item for item in x.split() if item.isdigit()]))   # Number of numerics
case[['sentence','num_words','num_char','avg_word_len','stopwords','periods','numerics']].head(5)

                    sentence  num_words  num_char  ...  stopwords  periods  numerics
0                 5 Ala. 740          3        10  ...          0        1         2
1  Supreme Court of Alabama.          4        25  ...          1        1         0
2                      ADAMS          1         5  ...          0        0         0
3                         v.          1         2  ...          0        1         0
4         TANNER AND HORTON.          3        18  ...          0        1         0

[5 rows x 7 columns]

In [358]:
# Number of numerics: shows the list of the numeric values
#case['numerics'] = case['sentence'].apply(lambda x: [item for item in x.split() if item.isdigit()])
#case[['sentence','num_words','num_char','avg_word_len','stopwords','periods','numerics']].head(5)

In [359]:
# Number of uppercase: it counts the words with all uppercase letters
case['upper_case'] = case['sentence'].apply(lambda x: len([item for item in x.split() if item.isupper()])) 
case[['sentence','num_words','num_char','avg_word_len','stopwords','periods','numerics','upper_case']].head(5)

                    sentence  num_words  ...  numerics  upper_case
0                 5 Ala. 740          3  ...         2           0
1  Supreme Court of Alabama.          4  ...         0           0
2                      ADAMS          1  ...         0           1
3                         v.          1  ...         0           0
4         TANNER AND HORTON.          3  ...         0           3

[5 rows x 8 columns]

In [360]:
# Number of uppercase: it shows the list of words with all uppercase letters in each sentence
#case['upper_case'] = case['sentence'].apply(lambda x: [item for item in x.split() if item.isupper()]) 
#case[['sentence','num_words','num_char','avg_word_len','stopwords','periods','numerics','upper_case']].head(5)

###1.2 Basic Text Pre-processing of text data

In [361]:
case['sentence'] = case['sentence'].str.lower()      #Change all the letters to lowercase
case[['sentence']].head(5)

                    sentence
0                 5 ala. 740
1  supreme court of alabama.
2                      adams
3                         v.
4         tanner and horton.

In [362]:
case['sentence'] = case['sentence'].str.replace('[^\w\s]','')     #one way to remove punctuation
case[['sentence']].head(5)

                   sentence
0                 5 ala 740
1  supreme court of alabama
2                     adams
3                         v
4         tanner and horton

In [363]:
import string
case['sentence'].str.replace('[{}]'.format(string.punctuation), '')          #another way to remove punctuation
case[['sentence']].head(5)

                   sentence
0                 5 ala 740
1  supreme court of alabama
2                     adams
3                         v
4         tanner and horton

In [364]:
from nltk.corpus import stopwords
import nltk
nltk.download('stopwords')                          #one way to remove stopwords 
stop_list = stopwords.words('english')
#case['sentence'] = case['sentence'].apply(lambda x: [item for item in x if item not in stop_list])
case['sentence'] = case['sentence'].apply(lambda x: ' '.join(item for item in x.split() if item not in stop_list))
case[['sentence']].head(5)

[nltk_data] Downloading package stopwords to /root/nltk_data...
[nltk_data]   Package stopwords is already up-to-date!

                sentence
0              5 ala 740
1  supreme court alabama
2                  adams
3                      v
4          tanner horton

In [365]:
#pat = r'\b(?:{})\b'.format('|'.join(stop_list))                   #another way to remove stopwords
#case['sentence'] = case['sentence'].str.replace(pat, '')
#case['sentence'] = case['sentence'].str.replace(r'\s+', ' ')
#case[['sentence']].head()

In [366]:
from collections import Counter

In [367]:
#word_freq = Counter(case['sentence'])                     #one way to find most common words regardless of the stopwords
#common_words = word_freq.most_common(5)
#common_words

In [368]:
#another way to find most common words regardless of the stopwords
common= pd.Series(' '.join(case['sentence']).split()).value_counts()[:10]
common

case       11
v          11
court       8
term        7
cited       7
2           6
circuit     5
hon         5
tried       5
appeal      4
dtype: int64

In [369]:
 #to remove most common words
common = list (common.index)
case['sentence'] = case['sentence'].apply(lambda x: ' '.join(item for item in x.split() if item not in common))
case['sentence'].head(10)

0            5 ala 740
1      supreme alabama
2                adams
3
4        tanner horton
5             synopsis
6    writ error sumter
7
8       west headnotes
9                    1
Name: sentence, dtype: object

In [370]:
#to find the last 20 rare words                         #can get different results anytime running these codes
rare= pd.Series(' '.join(case['sentence']).split()).value_counts()[-20:]
rare

8             1
end           1
coats         1
horton        1
sawyer        1
b             1
1876          1
moore         1
waiver        1
remedies      1
etowah        1
barbour       1
references    1
supreme       1
jul           1
lien          1
jun           1
joness        1
firms         1
reuters       1
dtype: int64

In [371]:
# to remove the rare values
rare = list (rare.index)
case['sentence'] = case['sentence'].apply(lambda x: ' '.join(item for item in x.split() if item not in rare))
case['sentence'].head(10)

0            5 ala 740
1              alabama
2                adams
3
4               tanner
5             synopsis
6    writ error sumter
7
8       west headnotes
9                    1
Name: sentence, dtype: object

In [372]:
# to do the spell correction     # by using [:10] limitted the results to top 10, by removing [:10] the results  
from textblob import TextBlob    # would be for the rest of the data
#case['sentence'][:10].apply(lambda x: str(TextBlob(x).correct()))
case['sentence'] = case['sentence'].apply(lambda x: str(TextBlob(x).correct()))
case['sentence'].head(10)

0            5 all 740
1              alabama
2                adams
3
4               manner
5              sycosis
6    writ error sumter
7
8       west headnotes
9                    1
Name: sentence, dtype: object

In [373]:
# Tokenization
nltk.download('punkt')

[nltk_data] Downloading package punkt to /root/nltk_data...
[nltk_data]   Package punkt is already up-to-date!

True

In [374]:
TextBlob(case['sentence'][6]).words      # this code will tokenized the chosen sentence from dataframe

WordList(['writ', 'error', 'sumter'])

In [375]:
import re

def tokenize(txt):
  tokens = re.split('\W+',txt)
  return tokens
case['tokenozed_sentence'] = case['sentence'].apply(lambda x: tokenize(x.lower()))
case.head(10)

            sentence  num_char  ...  upper_case     tokenozed_sentence
0          5 all 740        10  ...           0          [5, all, 740]
1            alabama        25  ...           0              [alabama]
2              adams         5  ...           1                [adams]
3                            2  ...           0                     []
4             manner        18  ...           3               [manner]
5            sycosis         8  ...           0              [sycosis]
6  writ error sumter        45  ...           1  [writ, error, sumter]
7                            1  ...           0                     []
8     west headnotes        18  ...           0      [west, headnotes]
9                  1         3  ...           0                    [1]

[10 rows x 9 columns]

In [377]:
#Stemming
from nltk.stem import PorterStemmer
st = PorterStemmer()
case['sentence'] = case['sentence'].apply(lambda x: ' '.join([st.stem(word) for word in x.split()]))
case['sentence'].head(10)

0            5 all 740
1              alabama
2                 adam
3
4               manner
5               sycosi
6    writ error sumter
7
8         west headnot
9                    1
Name: sentence, dtype: object

In [380]:
# Lemmatization
from textblob import Word
nltk.download('wordnet')

[nltk_data] Downloading package wordnet to /root/nltk_data...
[nltk_data]   Unzipping corpora/wordnet.zip.

True

In [384]:
case['sentence'] = case['sentence'].apply(lambda x: ' '.join([Word(word).lemmatize() for word in x.split()]))
case.head(10)

            sentence  num_char  ...  upper_case     tokenozed_sentence
0          5 all 740        10  ...           0          [5, all, 740]
1            alabama        25  ...           0              [alabama]
2               adam         5  ...           1                [adams]
3                            2  ...           0                     []
4             manner        18  ...           3               [manner]
5             sycosi         8  ...           0              [sycosis]
6  writ error sumter        45  ...           1  [writ, error, sumter]
7                            1  ...           0                     []
8       west headnot        18  ...           0      [west, headnotes]
9                  1         3  ...           0                    [1]

[10 rows x 9 columns]

###1.3 Save all the clean sentences to a csv file (one column, each raw is a sentence) after finishing all the steps above.

In [396]:
import numpy as np
#in the last dataframe results there are some rows without any sentences. So, to convert to csv with one colimn with sentence in each row,
#first the empty rows must be removed, to do that replace the empty space with NaN and then remove any rows contain NaN
case['sentence'].replace('',np.nan, inplace = True)
case['sentence']

0                        5 all 740
1                          alabama
2                             adam
3                              NaN
4                           manner
                  ...
102                    file situat
103                  neg treatment
104    neg treatment result situat
105                        histori
106          histori result situat
Name: sentence, Length: 107, dtype: object

In [397]:
case.dropna(subset=['sentence'],inplace = True)
case['sentence']

0                        5 all 740
1                          alabama
2                             adam
4                           manner
5                           sycosi
                  ...
102                    file situat
103                  neg treatment
104    neg treatment result situat
105                        histori
106          histori result situat
Name: sentence, Length: 72, dtype: object

In [398]:
case['sentence'].to_csv(index= False)     #to remove the header write header=False

'sentence\n5 all 740\nalabama\nadam\nmanner\nsycosi\nwrit error sumter\nwest headnot\n1\nchattel mortgag\ncrop\n4 case cite headnot\ncreditor\nprioriti\n5 case cite headnot\nattorney law\nopinion\ndissent opinion\nsituat\ndocument\n2019 thomson claim origin u govern work\nbite 9\ntreatment\ntitl\ndate\ntype\ndepth\nheadnot\n1 hooker armi\ndec\ngrover convers cotton citi montgomeri john cunningham\njan 1872\n3 gibb manner\nbanish wage exempt citi montgomeri john cunningham\njan 1871\n4 mckenzi ampl\ntrial right properti cotton hale\njan 1858\n5 evan later\nerror autauga\n1852\n6 dewey woman\n1857\nmention\n7 tree\ngrover convers three bale cotton wm l whitlow\nnov 1880\nmention\nedward thompson\nmay 1887\n9 grow crop subject levi seizur attach execut\n103 all 464\n1936\nall\ntabl author 3\ntreatment\nrefer titl\ntype\ndepth\nquot\npage number\nmention\n1 austin\nperson hayfield\nwrit error tuskaloosa\nmention\n3 stewart doughi\nfile\nfile situat\nneg treatment\nneg treatment result situat\nhistori\nhistori result situat\n'

In [410]:
case['sentence'].to_csv('excercise4.csv',index=False)   #to give the name to the file

In [417]:
#to give the path to save the file
case['sentence'].to_csv(r'C:\Users\AZ\Desktop\A Data Science- Spring 2021\INFO 5731\Assignments-Data\excercise4.csv',index = False)

###1.4 Advance Text Processing
###Calculate the term frequency of all the terms. Print out top 10 1-gram, top 10 2-grams, and top 10 3-grams terms as features.

In [430]:
###Calculate the term frequency of all the terms.
tf1=(case['sentence']).apply(lambda x: pd.value_counts(x.split(' '))).sum(axis = 0).reset_index()
tf1.columns = ['words','tf']
tf1

       words   tf
0          5  3.0
1        all  3.0
2        740  1.0
3    alabama  1.0
4       adam  1.0
..       ...  ...
108  stewart  1.0
109     file  2.0
110      neg  2.0
111   result  2.0
112  histori  2.0

[113 rows x 2 columns]

###Print out top 10 1-gram, top 10 2-grams, and top 10 3-grams terms as features.

In [447]:
from itertools import chain

In [492]:
#Print out top 10 1-gram
def find_ngrams(input_list ,n):
  return list(zip(*[input_list[i:] for i in range(n)]))
case['monograms'] = case['sentence'].map(lambda x: find_ngrams(x.split(' '),1))
case['sentence'].head(10)
monograms = case['monograms'].tolist()
monograms = list (chain(*monograms))
monograms = [x for x in monograms]
monogram_counts = Counter(monograms)
monogram_counts.most_common(10)

[(('headnot',), 4),
 (('situat',), 4),
 (('treatment',), 4),
 (('mention',), 4),
 (('5',), 3),
 (('all',), 3),
 (('error',), 3),
 (('1',), 3),
 (('cotton',), 3),
 (('jan',), 3)]

In [499]:
#Print out top 10 2-gram

def find_ngrams(input_list ,n):
  return list(zip(*[input_list[i:] for i in range(n)]))
case['bigrams'] = case['sentence'].map(lambda x: find_ngrams(x.split(' '),2))
case['sentence'].head(10)
bigrams = case['bigrams'].tolist()
bigrams = list (chain(*bigrams))
bigrams = [(x , y) for x, y in bigrams]
bigram_counts = Counter(bigrams)
bigram_counts.most_common(10)

[(('writ', 'error'), 2),
 (('case', 'cite'), 2),
 (('cite', 'headnot'), 2),
 (('grover', 'convers'), 2),
 (('citi', 'montgomeri'), 2),
 (('montgomeri', 'john'), 2),
 (('john', 'cunningham'), 2),
 (('neg', 'treatment'), 2),
 (('result', 'situat'), 2),
 (('5', 'all'), 1)]

In [528]:
##Print out top 10 3-gram
def find_ngrams(input_list ,n):
  return list(zip(*[input_list[i:] for i in range(n)]))
case['trigrams'] = case['sentence'].map(lambda x: find_ngrams(x.split(' '),3))
case['sentence'].head(10)
trigrams = case['trigrams'].tolist()
trigrams = list (chain(*trigrams))
trigrams = [(x,y,z) for x,y,z in trigrams]
trigram_counts = Counter(trigrams)
trigram_counts.most_common(10)

[(('case', 'cite', 'headnot'), 2),
 (('citi', 'montgomeri', 'john'), 2),
 (('montgomeri', 'john', 'cunningham'), 2),
 (('5', 'all', '740'), 1),
 (('writ', 'error', 'sumter'), 1),
 (('4', 'case', 'cite'), 1),
 (('5', 'case', 'cite'), 1),
 (('2019', 'thomson', 'claim'), 1),
 (('thomson', 'claim', 'origin'), 1),
 (('claim', 'origin', 'u'), 1)]

# 2. Python Regular Expression

## 2.1 Write a Python program to remove leading zeros from an IP address. (4 points)

ip = "260.08.094.109"

In [605]:
# one way to remove leading zeros from ip address

import re
ip = "260.08.094.109"
string = re.sub('\.[0]*','.',ip)
print(string)

260.8.94.109

In [606]:
#another way to remove the leading zeros from ip address
def removeZeros(ip):
  ip_address = '.'.join([str(int(i)) for i in ip.split('.')])
  return ip_address;
ip="260.08.094.109"
print(removeZeros(ip))

260.8.94.109

## 2.2 Write a Python Program to extract all the years from the following sentence. (4 points)

sentence = "The 2010s were a dramatic decade, filled with ups and downs, more than 1000 stroies have happened. As the decade comes to a close, Insider took a look back at some of the biggest headline-grabbing stories, from 2010 to 2019. The result was 119 news stories that ranged from the heartwarming rescue of a Thai boys' soccer team from a flooded cave to the divisive election of President Donald Trump."

In [626]:

import re
import datetime
from datetime import date
from dateutil.parser import parse
sentence = "The 2010s were a dramatic decade, filled with ups and downs, more than 1000 stroies have happened. As the decade comes to a close, \
Insider took a look back at some of the biggest headline-grabbing stories, from 2010 to 2019. The result was 119 news stories that ranged \
from the heartwarming rescue of a Thai boys' soccer team from a flooded cave to the divisive election of President Donald Trump."
all_years= re.findall(r'\d{4}', sentence)
print(all_years)

['2010', '1000', '2010', '2019']

In [630]:
import re
sentence = "The 2010s were a dramatic decade, filled with ups and downs, more than 1000 stroies have happened. As the decade comes to a close, \
Insider took a look back at some of the biggest headline-grabbing stories, from 2010 to 2019. The result was 119 news stories that ranged \
from the heartwarming rescue of a Thai boys' soccer team from a flooded cave to the divisive election of President Donald Trump."
def all_years(sentence):
  return re.findall(r'/(\d{4})/(\d{})/(\d{})/',sentence)
print(all_years(sentence))

[]

In [594]:
!pip install date_extractor

Requirement already satisfied: date_extractor in /usr/local/lib/python3.6/dist-packages (5.1.5)
Requirement already satisfied: pytz in /usr/local/lib/python3.6/dist-packages (from date_extractor) (2018.9)
Requirement already satisfied: regex in /usr/local/lib/python3.6/dist-packages (from date_extractor) (2019.12.20)

In [615]:
import date_extractor
from date_extractor import extract_dates
sentence = "The 2010s were a dramatic decade, filled with ups and downs, more than 1000 stroies have happened. As the decade comes to a close, \
Insider took a look back at some of the biggest headline-grabbing stories, from 2010 to 2019. The result was 119 news stories that ranged \
from the heartwarming rescue of a Thai boys' soccer team from a flooded cave to the divisive election of President Donald Trump."
dates = extract_dates(sentence)
#date, precision = extract_date(sentence, return_precision = True)
dates

[datetime.datetime(2010, 1, 1, 0, 0, tzinfo=<UTC>),
 datetime.datetime(2010, 1, 1, 0, 0, tzinfo=<UTC>),
 datetime.datetime(2019, 1, 1, 0, 0, tzinfo=<UTC>)]